; domain
(define (domain TPP-Propositional)
(:requirements :strips :typing)
(:types place locatable level - object
  depot market - place
  truck goods - locatable)

(:predicates (loaded ?g - goods ?t - truck ?l - level)
       (ready-to-load ?g - goods ?m - market ?l - level)
       (stored ?g - goods ?l - level)
       (on-sale ?g - goods ?m -  market ?l - level)
       (next ?l1 ?l2 - level)
       (at ?t - truck ?p - place)
       (connected ?p1 ?p2 - place))

(:action drive
 :parameters (?t - truck ?from ?to - place)
 :precondition (and (at ?t ?from) (connected ?from ?to))
 :effect (and (not (at ?t ?from)) (at ?t ?to)))

; ### LOAD ###
; ?l1 is the level of ?g ready to be loaded at ?m before loading
; ?l2 is the level of ?g ready to be loaded at ?m after loading
; ?l3 is the level of ?g in ?t before loading
; ?l4 is the level of ?g in ?t after loading

(:action load
 :parameters (?g - goods ?t - truck ?m - market ?l1 ?l2 ?l3 ?l4 - level)
 :precondition (and (at ?t ?m) (loaded ?g ?t ?l3)
        (ready-to-load ?g ?m ?l2) (next ?l2 ?l1) (next ?l4 ?l3))
 :effect (and (loaded ?g ?t ?l4) (not (loaded ?g ?t ?l3))
        (ready-to-load ?g ?m ?l1) (not (ready-to-load ?g ?m ?l2))))


; ### UNLOAD ###
; ?l1 is the level of ?g in ?t before unloading
; ?l2 is the level of ?g in ?t after unloading
; ?l3 is the level of ?g in ?d before unloading
; ?l4 is the level of ?g in ?d after unloading

(:action unload
 :parameters (?g - goods ?t - truck ?d - depot ?l1 ?l2 ?l3 ?l4 - level)
 :precondition (and (at ?t ?d) (loaded ?g ?t ?l2)
        (stored ?g ?l3) (next ?l2 ?l1) (next ?l4 ?l3))
 :effect (and (loaded ?g ?t ?l1) (not (loaded ?g ?t ?l2))
        (stored ?g ?l4) (not (stored ?g ?l3))))


; ### BUY ###
; ?l1 is the level of ?g on sale at ?m before buying
; ?l2 is the level of ?g on sale at ?m after buying
; ?l3 is the level of ?g ready to be loaded at ?m before buying
; ?l4 is the level of ?g ready to be loaded at ?m after buying

(:action buy
 :parameters (?t - truck ?g - goods ?m - market ?l1 ?l2 ?l3 ?l4 - level)
 :precondition (and (at ?t ?m) (on-sale ?g ?m ?l2) (ready-to-load ?g ?m ?l3)
        (next ?l2 ?l1) (next ?l4 ?l3))
 :effect (and (on-sale ?g ?m ?l1) (not (on-sale ?g ?m ?l2))
        (ready-to-load ?g ?m ?l4) (not (ready-to-load ?g ?m ?l3))))
)

; problem
; Domain designed by Alfonso Gerevini and Alessandro Saetti
; This file has been automatically generated by the generator available from
; http://zeus.ing.unibs.it/ipc-5/generators/index.html

(define (problem TPP)
(:domain TPP-Propositional)
(:objects
  goods1 goods2 goods3 goods4 goods5 - goods
  truck1 truck2 truck3 - truck
  market1 market2 market3 - market
  depot1 depot2 depot3 - depot
  level0 level1 level2 level3 - level)

(:init
  (next level1 level0)
  (next level2 level1)
  (next level3 level2)
  (ready-to-load goods1 market1 level0)
  (ready-to-load goods1 market2 level0)
  (ready-to-load goods1 market3 level0)
  (ready-to-load goods2 market1 level0)
  (ready-to-load goods2 market2 level0)
  (ready-to-load goods2 market3 level0)
  (ready-to-load goods3 market1 level0)
  (ready-to-load goods3 market2 level0)
  (ready-to-load goods3 market3 level0)
  (ready-to-load goods4 market1 level0)
  (ready-to-load goods4 market2 level0)
  (ready-to-load goods4 market3 level0)
  (ready-to-load goods5 market1 level0)
  (ready-to-load goods5 market2 level0)
  (ready-to-load goods5 market3 level0)
  (stored goods1 level0)
  (stored goods2 level0)
  (stored goods3 level0)
  (stored goods4 level0)
  (stored goods5 level0)
  (loaded goods1 truck1 level0)
  (loaded goods1 truck2 level0)
  (loaded goods1 truck3 level0)
  (loaded goods2 truck1 level0)
  (loaded goods2 truck2 level0)
  (loaded goods2 truck3 level0)
  (loaded goods3 truck1 level0)
  (loaded goods3 truck2 level0)
  (loaded goods3 truck3 level0)
  (loaded goods4 truck1 level0)
  (loaded goods4 truck2 level0)
  (loaded goods4 truck3 level0)
  (loaded goods5 truck1 level0)
  (loaded goods5 truck2 level0)
  (loaded goods5 truck3 level0)
  (connected market1 market3)
  (connected market2 market3)
  (connected market3 market1)
  (connected market3 market2)
  (connected depot1 market2)
  (connected market2 depot1)
  (connected depot2 market2)
  (connected market2 depot2)
  (connected depot3 market1)
  (connected market1 depot3)
  (on-sale goods1 market1 level3)
  (on-sale goods2 market1 level3)
  (on-sale goods3 market1 level3)
  (on-sale goods4 market1 level1)
  (on-sale goods5 market1 level3)
  (on-sale goods1 market2 level0)
  (on-sale goods2 market2 level0)
  (on-sale goods3 market2 level0)
  (on-sale goods4 market2 level0)
  (on-sale goods5 market2 level0)
  (on-sale goods1 market3 level0)
  (on-sale goods2 market3 level0)
  (on-sale goods3 market3 level0)
  (on-sale goods4 market3 level0)
  (on-sale goods5 market3 level0)
  (at truck1 depot3)
  (at truck2 depot2)
  (at truck3 depot2))

(:goal (and
  (stored goods1 level2)
  (stored goods2 level3)
  (stored goods3 level1)
  (stored goods4 level1)
  (stored goods5 level1)))

)

; plan
1. (drive truck1 depot3 market1)
   deleted: (at truck1 depot3)
   added: (at truck1 market1)
   goals met: 0 of 5
2. (buy truck1 goods5 market1 level2 level3 level0 level1)
   deleted: (on-sale goods5 market1 level3) (ready-to-load goods5 market1 level0)
   added: (on-sale goods5 market1 level2) (ready-to-load goods5 market1 level1)
   goals met: 0 of 5
3. (load goods5 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods5 truck1 level0) (ready-to-load goods5 market1 level1)
   added: (loaded goods5 truck1 level1) (ready-to-load goods5 market1 level0)
   goals met: 0 of 5
4. (buy truck1 goods4 market1 level0 level1 level0 level1)
   deleted: (on-sale goods4 market1 level1) (ready-to-load goods4 market1 level0)
   added: (on-sale goods4 market1 level0) (ready-to-load goods4 market1 level1)
   goals met: 0 of 5
5. (load goods4 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods4 truck1 level0) (ready-to-load goods4 market1 level1)
   added: (loaded goods4 truck1 level1) (ready-to-load goods4 market1 level0)
   goals met: 0 of 5
6. (buy truck1 goods3 market1 level2 level3 level0 level1)
   deleted: (on-sale goods3 market1 level3) (ready-to-load goods3 market1 level0)
   added: (on-sale goods3 market1 level2) (ready-to-load goods3 market1 level1)
   goals met: 0 of 5
7. (load goods3 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods3 truck1 level0) (ready-to-load goods3 market1 level1)
   added: (loaded goods3 truck1 level1) (ready-to-load goods3 market1 level0)
   goals met: 0 of 5
8. (buy truck1 goods2 market1 level2 level3 level0 level1)
   deleted: (on-sale goods2 market1 level3) (ready-to-load goods2 market1 level0)
   added: (on-sale goods2 market1 level2) (ready-to-load goods2 market1 level1)
   goals met: 0 of 5
9. (buy truck1 goods1 market1 level2 level3 level0 level1)
   deleted: (on-sale goods1 market1 level3) (ready-to-load goods1 market1 level0)
   added: (on-sale goods1 market1 level2) (ready-to-load goods1 market1 level1)
   goals met: 0 of 5
10. (drive truck1 market1 depot3)
   deleted: (at truck1 market1)
   added: (at truck1 depot3)
   goals met: 0 of 5
11. (unload goods5 truck1 depot3 level0 level1 level0 level1)
   deleted: (loaded goods5 truck1 level1) (stored goods5 level0)
   added: (loaded goods5 truck1 level0) (stored goods5 level1)
   goals met: 1 of 5
12. (unload goods4 truck1 depot3 level0 level1 level0 level1)
   deleted: (loaded goods4 truck1 level1) (stored goods4 level0)
   added: (loaded goods4 truck1 level0) (stored goods4 level1)
   goals met: 2 of 5
13. (unload goods3 truck1 depot3 level0 level1 level0 level1)
   deleted: (loaded goods3 truck1 level1) (stored goods3 level0)
   added: (loaded goods3 truck1 level0) (stored goods3 level1)
   goals met: 3 of 5
14. (drive truck1 depot3 market1)
   deleted: (at truck1 depot3)
   added: (at truck1 market1)
   goals met: 3 of 5
15. (load goods1 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods1 truck1 level0) (ready-to-load goods1 market1 level1)
   added: (loaded goods1 truck1 level1) (ready-to-load goods1 market1 level0)
   goals met: 3 of 5
16. (drive truck1 market1 depot3)
   deleted: (at truck1 market1)
   added: (at truck1 depot3)
   goals met: 3 of 5
17. (unload goods1 truck1 depot3 level0 level1 level0 level1)
   deleted: (loaded goods1 truck1 level1) (stored goods1 level0)
   added: (loaded goods1 truck1 level0) (stored goods1 level1)
   goals met: 3 of 5
18. (drive truck1 depot3 market1)
   deleted: (at truck1 depot3)
   added: (at truck1 market1)
   goals met: 3 of 5
19. (buy truck1 goods1 market1 level1 level2 level0 level1)
   deleted: (on-sale goods1 market1 level2) (ready-to-load goods1 market1 level0)
   added: (on-sale goods1 market1 level1) (ready-to-load goods1 market1 level1)
   goals met: 3 of 5
20. (load goods1 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods1 truck1 level0) (ready-to-load goods1 market1 level1)
   added: (loaded goods1 truck1 level1) (ready-to-load goods1 market1 level0)
   goals met: 3 of 5
21. (drive truck1 market1 depot3)
   deleted: (at truck1 market1)
   added: (at truck1 depot3)
   goals met: 3 of 5
22. (unload goods1 truck1 depot3 level0 level1 level1 level2)
   deleted: (loaded goods1 truck1 level1) (stored goods1 level1)
   added: (loaded goods1 truck1 level0) (stored goods1 level2)
   goals met: 4 of 5
23. (drive truck1 depot3 market1)
   deleted: (at truck1 depot3)
   added: (at truck1 market1)
   goals met: 4 of 5
24. (load goods2 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods2 truck1 level0) (ready-to-load goods2 market1 level1)
   added: (loaded goods2 truck1 level1) (ready-to-load goods2 market1 level0)
   goals met: 4 of 5
25. (drive truck1 market1 depot3)
   deleted: (at truck1 market1)
   added: (at truck1 depot3)
   goals met: 4 of 5
26. (unload goods2 truck1 depot3 level0 level1 level0 level1)
   deleted: (loaded goods2 truck1 level1) (stored goods2 level0)
   added: (loaded goods2 truck1 level0) (stored goods2 level1)
   goals met: 4 of 5
27. (drive truck1 depot3 market1)
   deleted: (at truck1 depot3)
   added: (at truck1 market1)
   goals met: 4 of 5
28. (buy truck1 goods2 market1 level1 level2 level0 level1)
   deleted: (on-sale goods2 market1 level2) (ready-to-load goods2 market1 level0)
   added: (on-sale goods2 market1 level1) (ready-to-load goods2 market1 level1)
   goals met: 4 of 5
29. (load goods2 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods2 truck1 level0) (ready-to-load goods2 market1 level1)
   added: (loaded goods2 truck1 level1) (ready-to-load goods2 market1 level0)
   goals met: 4 of 5
30. (drive truck1 market1 depot3)
   deleted: (at truck1 market1)
   added: (at truck1 depot3)
   goals met: 4 of 5
31. (unload goods2 truck1 depot3 level0 level1 level1 level2)
   deleted: (loaded goods2 truck1 level1) (stored goods2 level1)
   added: (loaded goods2 truck1 level0) (stored goods2 level2)
   goals met: 4 of 5
32. (drive truck1 depot3 market1)
   deleted: (at truck1 depot3)
   added: (at truck1 market1)
   goals met: 4 of 5
33. (buy truck1 goods2 market1 level0 level1 level0 level1)
   deleted: (on-sale goods2 market1 level1) (ready-to-load goods2 market1 level0)
   added: (on-sale goods2 market1 level0) (ready-to-load goods2 market1 level1)
   goals met: 4 of 5
34. (load goods2 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods2 truck1 level0) (ready-to-load goods2 market1 level1)
   added: (loaded goods2 truck1 level1) (ready-to-load goods2 market1 level0)
   goals met: 4 of 5
35. (drive truck1 market1 depot3)
   deleted: (at truck1 market1)
   added: (at truck1 depot3)
   goals met: 4 of 5
36. (unload goods2 truck1 depot3 level0 level1 level2 level3)
   deleted: (loaded goods2 truck1 level1) (stored goods2 level2)
   added: (loaded goods2 truck1 level0) (stored goods2 level3)
   goals met: 5 of 5
